In [1]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\\Machine Learning\\inttable.csv')
df

   roll    id  marks  percent  socialuse
0     1  1001     12     10.0          5
1     2  1002     88     88.0          1
2     3  1003     44     44.0          3
3     4  1004     55     55.0          5
4     5  1005     12      NaN          9
5     6  1006     99     99.0          3
6     7  1007     55     66.0          4
7     8  1008     10     10.0         12
8     9  1009     78     78.0          3
9    10  1010     78     78.0          3

# loc[] : Uses Labels as index

In [29]:
df.loc[0]

roll            1.0
id           1001.0
marks          12.0
percent        10.0
socialuse       5.0
Name: 0, dtype: float64

In [6]:
df.loc[9]

roll           10.0
id           1010.0
marks          78.0
percent        78.0
socialuse       3.0
Name: 9, dtype: float64

In [7]:
df.loc[[1,2,3]]

   roll    id  marks  percent  socialuse
1     2  1002     88     88.0          1
2     3  1003     44     44.0          3
3     4  1004     55     55.0          5

In [8]:
df.loc[[1,2,5]]

   roll    id  marks  percent  socialuse
1     2  1002     88     88.0          1
2     3  1003     44     44.0          3
5     6  1006     99     99.0          3

In [10]:
df.loc[1,'marks']

88

In [12]:
df.loc[0:3,'id']

0    1001
1    1002
2    1003
3    1004
Name: id, dtype: int64

In [17]:
df.loc[df['roll']<11,['percent']]

   percent
0     10.0
1     88.0
2     44.0
3     55.0
4      NaN
5     99.0
6     66.0
7     10.0
8     78.0
9     78.0

In [19]:
df.loc[df['roll']<11]

   roll    id  marks  percent  socialuse
0     1  1001     12     10.0          5
1     2  1002     88     88.0          1
2     3  1003     44     44.0          3
3     4  1004     55     55.0          5
4     5  1005     12      NaN          9
5     6  1006     99     99.0          3
6     7  1007     55     66.0          4
7     8  1008     10     10.0         12
8     9  1009     78     78.0          3
9    10  1010     78     78.0          3

# iloc[] : uses Integer as an index instead of label in loc

In [20]:
df.iloc[0]

roll            1.0
id           1001.0
marks          12.0
percent        10.0
socialuse       5.0
Name: 0, dtype: float64

In [21]:
df.iloc[[0]]

   roll    id  marks  percent  socialuse
0     1  1001     12     10.0          5

In [22]:
df.iloc[:,0]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll, dtype: int64

In [26]:
df.iloc[[True,False,True,True,True,True,True,True,True,False]]

   roll    id  marks  percent  socialuse
0     1  1001     12     10.0          5
2     3  1003     44     44.0          3
3     4  1004     55     55.0          5
4     5  1005     12      NaN          9
5     6  1006     99     99.0          3
6     7  1007     55     66.0          4
7     8  1008     10     10.0         12
8     9  1009     78     78.0          3

In [31]:
df.iloc[-1]

roll           10.0
id           1010.0
marks          78.0
percent        78.0
socialuse       3.0
Name: 9, dtype: float64

In [35]:
df

   roll    id  marks  percent  socialuse
0     1  1001     12     10.0          5
1     2  1002     88     88.0          1
2     3  1003     44     44.0          3
3     4  1004     55     55.0          5
4     5  1005     12      NaN          9
5     6  1006     99     99.0          3
6     7  1007     55     66.0          4
7     8  1008     10     10.0         12
8     9  1009     78     78.0          3
9    10  1010     78     78.0          3

In [34]:
df.iloc[:2,3]

0    10.0
1    88.0
Name: percent, dtype: float64